<a href="https://colab.research.google.com/github/yhy0519/The_first_step_of_Python/blob/main/python09_12_07.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**■ 판다스로 조인하기**

판다스로 조인(join) 하기 위해서는 merge 를 사용하면 됩니다.

문법:

    pandas.merge( emp, dept, how = 'inner', on = 'deptno' )

옵션 :

    how = 'inner' : emp 와 dept 데이터 프레임에 공통적으로 존재하는 교집합일 경우에만 추출
    how = 'outer' : 열의 데이터가 양쪽 데이터 프레임에 공통적으로 존재하는 교집합이 아니어도 추출
    how = 'left' : 왼쪽 데이터 프레임의 키열에 속하는 데이터 값을 기준으로 병합
    how = 'right' 오른쪽 데이터 프레임의 키열에 속하는 데이터 값을 기준으로 병합

SQL>

    select e.ename, d.loc
       from emp e, dept d
       where e.deptno = d.deptno (+);

Pandas>

In [ ]:
import pandas as pd
emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
dept = pd.read_csv('/content/drive/MyDrive/data/dept3.csv')
result = pd.merge( emp, dept, on = 'deptno', how = 'left' )
print( result[['ename', 'loc']] )

     ename       loc
0     KING  NEW YORK
1    BLAKE   CHICAGO
2    CLARK  NEW YORK
3    JONES    DALLAS
4   MARTIN   CHICAGO
5    ALLEN   CHICAGO
6   TURNER   CHICAGO
7    JAMES   CHICAGO
8     WARD   CHICAGO
9     FORD    DALLAS
10   SMITH    DALLAS
11   SCOTT    DALLAS
12   ADAMS    DALLAS
13  MILLER  NEW YORK

문제221. 부서번호, 부서번호별 평균월급을 출력하시오!

SQL>

    select deptno, avg(sal)
       from emp
       group by deptno;

Pandas>

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('deptno')['sal'].mean().reset_index()
print(result)

   deptno          sal
0      10  2916.666667
1      20  2175.000000
2      30  1566.666667

설명: groupby 부터 시작해서 reset_index() 까지가 한 세트 이므로 항상 같이 사용하면 됩니다.

문제222. 위의 결과에서 평균월급을 출력할 때 정수부분만 출력하고 싶다면? ( 소수점 이전만 출력 )

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('deptno')['sal'].mean().reset_index().astype(int)
print(result)

   deptno   sal
0      10  2916
1      20  2175
2      30  1566

설명: astype(int) 는 출력되는 데이터에서 정수부분만 취해라라는 뜻입니다.  
정수형으로 변환해라 ~ 라는 뜻입니다.

문제223. 직업과 직업별 토탈월급을 출력하시오!

SQL>

    select job,sum(sal)
       from emp
       group by job;

Pandas>

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('job')['sal'].sum().reset_index()
print(result)

         job   sal
0    ANALYST  6000
1      CLERK  4150
2    MANAGER  8275
3  PRESIDENT  5000
4   SALESMAN  5600

문제224. 부서위치, 부서위치별 토탈월급을 출력하시오 !

SQL>

    select d.loc, sum(e.sal)
       from emp e, dept d
       where e.deptno = d.deptno
       group by d.loc;

Pandas>

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
dept = pd.read_csv('/content/drive/MyDrive/data/dept3.csv')
result = pd.merge(emp, dept, on = 'deptno')
result2 = result.groupby('loc')['sal'].sum().reset_index()
print(result2)

        loc    sal
0   CHICAGO   9400
1    DALLAS  10875
2  NEW YORK   8750

문제225. 아래의 SQL 을 pandas 로 구현하시오!

SQL>

    select d.loc, vnl(sum(e.sal), 0)
       from empm e, dept d
       where e.deptno (+) = d.deptno
       group by d.loc;

Pandas>

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
dept = pd.read_csv('/content/drive/MyDrive/data/dept3.csv')
result = pd.merge(emp, dept, on = 'deptno', how = 'right')
result2 = result.groupby('loc')['sal'].sum().reset_index()
print(result2)

        loc      sal
0    BOSTON      0.0
1   CHICAGO   9400.0
2    DALLAS  10875.0
3  NEW YORK   8750.0

문제226. 아래의 SQL 을 pandas 로 구현하시오!

SQL>

    select deptno, count(*)
       from emp
       group by deptno;

Pandas>

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('deptno')['empno'].count().reset_index()
print(result)

   deptno  empno
0      10      3
1      20      5
2      30      6

문제227. emp122.csv 를 내려받아 판다스 데이터 프레임으로 만들고 출력하시오!

In [ ]:
import pandas as pd

emp122 = pd.read_csv('/content/drive/MyDrive/data/emp122.csv')
print(emp122)

문제228. 통신사, 통신사별 인원수를 출력하시오!

In [ ]:
import pandas as pd

emp122 = pd.read_csv('/content/drive/MyDrive/data/emp122.csv')
result = emp122.groupby('TELECOM')['INDEX'].count().reset_index()
print(result)

  TELECOM  INDEX
0      kt     15
1      lg      4
2      sk     11

문제229. 우리반 테이블에서 통신사가 kt 이고 나이가 30살 이상인 학생들의 이름과 나이와 통신사를 출력하시오!

In [ ]:
import pandas as pd

emp122 = pd.read_csv('/content/drive/MyDrive/data/emp122.csv')
print(emp122[['ENAME', 'AGE', 'TELECOM']][(emp12['TELECOM'] == 'kt') & (emp12['AGE'] >= 30)])

설명: and 는 판다스에서 & 이고 or 는 판다스에서 | 입니다.  
	그리고 &, | 를 사용할 때는 양쪽 조건에 소괄호() 를 둘러줘야 합니다.

**■ 68. 반올림수 구하기(round)**

파이썬 내장함수 round() 는 인자로 입력된 숫자형 자리수에서 반올림한 결과를 리턴합니다.

예제:

In [ ]:
print( round(16.554) )      # 소수점 첫번째 자리에서 반올림  17
print( round(16.554, 0) )   # 소수점 첫번째 자리에서 반올림  17
print( round(16.554, 1) )   # 소수점 두번째 자리에서 반올림  16.6
print( round(16.554, 2) )   # 소수점 세번째 자리에서 반올림  16.55

17
17.0
16.6
16.55

** 파이썬에서 반올림할때 중요하게 알아야할 내용

    print( round(142.5)  )   # 143d으로 예상했는데 142가 나온다.

" R 과 파이썬은 짝수를 좋아합니다. "

    142.5 -------> 142         2        2.5        3
    187.5 -------> 188         7        7.5        8

파이썬은 기본적으로 이것을 해결하는 함수가 없습니다.  
0.5 일때는 짝수를 좋아하도록 반올림되고 0.51 일때는 그냥 반올림됩니다.

예제. Pandas 를 이용하지 않고 파이썬으로만 emp3.csv 에서 이름과 월급을 출력하시오 !

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv')   # emp2.csv 를 읽어서 file 이라는 변수에 넣는다.
emp_csv = csv.reader(file)                            # file 변수에 있는 csv 파일을 읽어서 emp_csv 변수에 넣는다.
print(emp_csv)                                        # 이 상태에서 그냥 프린트하면 메모리 주소가 나옵니다.

<_csv.reader object at 0x7fde8b902ba8>

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv') 
emp_csv = csv.reader(file)  

for emp_list in emp_csv:       # csv 파일의 내용을 한 행씩 리스트에 담아서 출력합니다.
    print( emp_list )

['7839', 'KING', 'PRESIDENT', '0', '1981-11-17', '5000', '0', '10']
['7698', 'BLAKE', 'MANAGER', '7839', '1981-05-01', '2850', '0', '30']
['7782', 'CLARK', 'MANAGER', '7839', '1981-05-09', '2450', '0', '10']
['7566', 'JONES', 'MANAGER', '7839', '1981-04-01', '2975', '0', '20']
['7654', 'MARTIN', 'SALESMAN', '7698', '1981-09-10', '1250', '1400', '30']
['7499', 'ALLEN', 'SALESMAN', '7698', '1981-02-11', '1600', '300', '30']
['7844', 'TURNER', 'SALESMAN', '7698', '1981-08-21', '1500', '0', '30']
['7900', 'JAMES', 'CLERK', '7698', '1981-12-11', '950', '0', '30']
['7521', 'WARD', 'SALESMAN', '7698', '1981-02-23', '1250', '500', '30']
['7902', 'FORD', 'ANALYST', '7566', '1981-12-11', '3000', '0', '20']
['7369', 'SMITH', 'CLERK', '7902', '1980-12-09', '800', '0', '20']
['7788', 'SCOTT', 'ANALYST', '7566', '1982-12-22', '3000', '0', '20']
['7876', 'ADAMS', 'CLERK', '7788', '1983-01-15', '1100', '0', '20']
['7934', 'MILLER', 'CLERK', '7782', '1982-01-11', '1300', '0', '10']

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv') 
emp_csv = csv.reader(file)  

for emp_list in emp_csv:
    print( emp_list[1], emp_list[5] )

KING 5000
BLAKE 2850
CLARK 2450
JONES 2975
MARTIN 1250
ALLEN 1600
TURNER 1500
JAMES 950
WARD 1250
FORD 3000
SMITH 800
SCOTT 3000
ADAMS 1100
MILLER 1300

문제230. Pandas 를 이용하지 말고 이름과 월급 * 12.3 을 출력하시오

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv') 
emp_csv = csv.reader(file)  

for emp_list in emp_csv:
    print( emp_list[1], int(emp_list[5]) * 12.3 )

KING 61500.0
BLAKE 35055.0
CLARK 30135.0
JONES 36592.5
MARTIN 15375.0
ALLEN 19680.0
TURNER 18450.0
JAMES 11685.0
WARD 15375.0
FORD 36900.0
SMITH 9840.0
SCOTT 36900.0
ADAMS 13530.0
MILLER 15990.000000000002

설명: csv 파일의 내용을 읽어서 출력할 때 기본적으로 월급도 문자형으로 출력되므로 산술연산을 하려면 int() 함수를 이용해서 숫자형으로 변환해주어야 합니다.

문제231. 위의 결과를 다시 출력하는데 소수점 첫번째 자리에서 반올림되게 하시오!

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv') 
emp_csv = csv.reader(file)  

for emp_list in emp_csv:
    print( emp_list[1], round(int(emp_list[5]) * 12.3) )

KING 61500
BLAKE 35055
CLARK 30135
JONES 36592
MARTIN 15375
ALLEN 19680
TURNER 18450
JAMES 11685
WARD 15375
FORD 36900
SMITH 9840
SCOTT 36900
ADAMS 13530
MILLER 15990

문제232. 직업이 SALESMAN 인 사원들의 이름과 직업을 출력하는데 판다스 이용하지말고 emp2.csv 를 읽어서 출력하시오 !

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    if emp_list[2] == 'SALESMAN':
        print(emp_list[1], emp_list[2])

MARTIN SALESMAN
ALLEN SALESMAN
TURNER SALESMAN
WARD SALESMAN

문제233. 부서번호가 20번인 사원들의 이름과 월급과 부서번호를 출력하시오 !

판다스를 이용한 방법:

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp[['ename', 'sal', 'deptno']][emp['deptno'] == 20]
print(result)

    ename   sal  deptno
3   JONES  2975      20
9    FORD  3000      20
10  SMITH   800      20
11  SCOTT  3000      20
12  ADAMS  1100      20

판다스를 이용하지 않은 방법:

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv')
emp_csv = csv.reader(file)

for emp_list in emp_csv:
    if emp_list[7] == '20':
        print(emp_list[1], emp_list[5], emp_list[7])

JONES 2975 20
FORD 3000 20
SMITH 800 20
SCOTT 3000 20
ADAMS 1100 20

**■ 69. 실수형 자료를 정수형 자료로 변환하기(int)**

** 파이썬의 변환함수 정리  
**	데이터 유형	변환함수

    정수형	   int	   int()
    문자형	   str	   str()
    실수형	   float	 float()
    리스트형	 list	  list()
    튜플형	   tuple	 tuple()

코드 작성시 수학연산을 하다보면 정수끼리만 계산해야하는 경우가 있습니다.  
이때 우리가 가진 데이터가 실수형이라면 실수형 자료를 정수형으로 변환한 후에 계산을 해주어야 합니다.  
파이썬 내장함수 int() 는 인자로 입력된 실수형 자료를 정수형 자료로 변환해줍니다.  
int() 는 입력된 실수형 자료의 소수부분은 버리고 정수부분만 취하여 정수값으로 리턴합니다.

예제:

In [ ]:
print( int(-5.4) )

-5

문제234. Pandas를 이용해서 emp3.csv 를 읽어다가 이름과 월급을 출력하는데 월급을 출력할때 소수점 이하는 버리고 정수부분만 출력되게하시오 !

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
print(emp[['ename', 'sal']])

     ename   sal
0     KING  5000
1    BLAKE  2850
2    CLARK  2450
3    JONES  2975
4   MARTIN  1250
5    ALLEN  1600
6   TURNER  1500
7    JAMES   950
8     WARD  1250
9     FORD  3000
10   SMITH   800
11   SCOTT  3000
12   ADAMS  1100
13  MILLER  1300

설명: int() 함수를 따로 쓰지 않아도 정수형으로 출력되고 있습니다.  
Pandas 를 이용하지 않았을때와 다르게 숫자는 바로 숫자형으로 출력해주고 있습니다.

**■ 70. 정수형 자료를 실수형 자료로 변환하기(float)**

이미지 처리나 공학용 프로그램을 작성할 때 실수형 끼리만 계산해야하는 경우가 많습니다.  
이 때 우리가 가진 데이터가 정수형이라고 하면 정수형 자료를 실수형 자료로 변환한 후에 계산해 주어야 합니다.  
파이썬 내장함수 float() 은 인자로 입력되 정수형 자료를 실수형으로 변환해 줍니다.

예:

In [ ]:
print( float(10) )

10.0

문제235. Pandas 를 이용해서 이름과 월급을 출력하는데 월급을 출력할 때 실수형으로 출력하시오 !

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
emp['sal'] = emp['sal'].apply(float)         # emp 데이터프레임의 sal 컬럼 데이터를 float(실수형)로 변환해서
                                             # emp 데이터 프레임의 sal 컬럼에 할당.
print(emp[['ename', 'sal']])

     ename     sal
0     KING  5000.0
1    BLAKE  2850.0
2    CLARK  2450.0
3    JONES  2975.0
4   MARTIN  1250.0
5    ALLEN  1600.0
6   TURNER  1500.0
7    JAMES   950.0
8     WARD  1250.0
9     FORD  3000.0
10   SMITH   800.0
11   SCOTT  3000.0
12   ADAMS  1100.0
13  MILLER  1300.0

설명: emp['sal'].apply() 는 emp 데이터 프레임에 sal 시리즈에 apply 함수를 적용해서 데이터 유형을 변경할 수 있습니다.

    emp['sal'].apply(float)  --> 이렇게 하면 데이터 유형을 실수형으로 변경하는 것

**■ 71. 정수 리스트에서 소수만 걸러내기(filter)**

파이썬 내장함수인 filter() 는 리스트와 같은 자료형에서
특정 조건을 만족하는 값만 편리하게 추출할 수 있는 방법을 제공합니다.  
filter() 의 첫번째 인자는 특정 조건의 값을 추출하는 함수가 입력되며 두번째 인자(입력매개변수) 는 리스트와 같은 자료형이 입력됩니다.

예제: 숫자가 나열되어있는 리스트에서 짝수만 추출해내는 코드를 작성

    a = [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ]

 1. 숫자를 입력하면 짝수이면 결과를 출력하고 홀수이면 출력하지 않는 함수 생성

In [ ]:
def get_even(num):
    if num % 2 == 0:
        return num
    else:
        return        # return 다음에 아무것도 쓰지 않으면 아무것도 리턴되지 않습니다.

print(get_even(2))   
print(get_even(7))

2
None

 2. filter 함수와 get_even 함수를 이용해서 위의 a 리스트에서 짝수를 추출하기

In [ ]:
a = [ 1, 2, 3, 4, 5, 6, 7, 8, 9, 10 ]

result = filter(get_even, a)   # filter( 함수이름,  리스트이름 )

print(result)           # 메모리 주소값
print( list(result) )   # list 함수로 리스트 자료형으로 변환해야 결과가 출력됩니다.

<filter object at 0x7fde8b90a8d0>
[2, 4, 6, 8, 10]

문제236. 아래의 리스트에서 숫자가 300 이상이면 출력하고 300 미만이면 출력되지 않게 하시오 !

    b = [ 100, 352, 254, 456, 123, 234, 567, 903 ]

In [ ]:
def get_over(num):
    if num >= 300:
        return num
    else:
        return

b = [ 100, 352, 254, 456, 123, 234, 567, 903 ]
result = filter(get_over, b)
print( list(result) )

[352, 456, 567, 903]

문제237. 우리반 데이터에서 나이가 30살 이상인 나이만 따로 결과 리스트로 출력하시오

In [ ]:
import pandas as pd

emp122 = pd.read_csv('/content/drive/MyDrive/data/emp122.csv')
a = []

for i in emp122['AGE']:
    if i >= 30:
        a.append(i)

print(a)

[31, 35, 33, 30, 36, 44]

**■ 72. 최대값, 최소값 구하기(max, min)**

max() 와 min() 은 인자로 입력된 자료에서 최대, 최소값을 구해주는 함수입니다.  
max() 와 min() 의 인자로 리스트와 같은 시퀀스 자료가 입력되면
스퀀스 자료의 요소 중 최대값 또는 최소값을 구하여 리턴합니다.

    오라클	 vs 	파이썬
      max	      	 max
      min	      	 min
     count	    	 count
      sum	      	 sum
      avg		       mean

예제:

In [ ]:
a = [ 8, 7, 12, 55, 21, 34, 15, 9, 22 ]
print( max(a) )

55

문제238. 사원 테이블에서 최대월급을 출력하시오 !

 1. 판다스를 이용했을 때

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp['sal'].max()
print(result)

5000

 2. 판다스를 이용하지 않았을 때

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp2.csv')
emp_csv = csv.reader(file)
sal = []

for i in emp_csv:
    sal.append( int(i[5]) )
  
print( max(sal) )

5000

문제239. 우리반 데이터(emp122.csv) 에서 최소나이를 출력하시오 !


 1. 판다스를 이용했을 때

In [ ]:
import pandas as pd

emp12 = pd.read_csv('/content/drive/MyDrive/data/emp122.csv')
result = emp12['AGE'].min()
print(result)

24

 2. 판다스를 이용하지 않았을 때(emp1222.csv)

In [ ]:
import csv

file = open('/content/drive/MyDrive/data/emp1222.csv', encoding = 'cp949')
emp1222 = csv.reader(file)
age = []

for i in emp1222:
    age.append( i[2] )
  
print(min(age))

24

**■ 73. 판다스에서 결측치(NaN) 확인하기**

emp3.csv 에 comm 처럼 결측치(NaN : Not a Number)를 처리하는 판다스 함수를 배웁니다.

예: Pandas 를 이용해서 이름과 커미션을 출력하시오 !

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
print(emp[['ename', 'comm']])

     ename    comm
0     KING     NaN
1    BLAKE     NaN
2    CLARK     NaN
3    JONES     NaN
4   MARTIN  1400.0
5    ALLEN   300.0
6   TURNER     0.0
7    JAMES     NaN
8     WARD   500.0
9     FORD     NaN
10   SMITH     NaN
11   SCOTT     NaN
12   ADAMS     NaN
13  MILLER     NaN

문제240. 커미션이 결측치(NaN) 인 사원들의 이름과 커미션을 출력하시오

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
print(emp[['ename', 'comm']][emp['comm'].isnull()])

     ename  comm
0     KING   NaN
1    BLAKE   NaN
2    CLARK   NaN
3    JONES   NaN
7    JAMES   NaN
9     FORD   NaN
10   SMITH   NaN
11   SCOTT   NaN
12   ADAMS   NaN
13  MILLER   NaN

문제241. 커미션이 결측치(NaN) 가 아닌 사원들의 이름과 커미션을 출력하시오 !

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
print(emp[['ename', 'comm']][~emp['comm'].isnull()])

    ename    comm
4  MARTIN  1400.0
5   ALLEN   300.0
6  TURNER     0.0
8    WARD   500.0

문제242. emp3.csv 에 결측치가 있는지 확인하는 방법 ?

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
print( emp.isnull().sum() )

index        0
empno        0
ename        0
job          0
mgr          1
hiredate     0
sal          0
comm        10
deptno       0
dtype: int64

설명: 결측치가 있으면 데이터 분석하기가 어렵고 머신러닝을 이용한 데이터 분석인 경우	좋은(정확도가 높은) 머신러닝 모델이 나오기 어렵습니다. 결측치를 처리 해줘야 합니다.

문제244. 타이타닉 데이터에 결측치가 어느 컬럼에 많은지 확인하시오 !

In [ ]:
import pandas as pd

tat = pd.read_csv('/content/drive/MyDrive/data/train.csv')
print( tat.isnull().sum() )

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

**■ 74. 판다스에서 파생변수 추가하는 방법**

파생변수란 기존의 데이터를 가지고 새롭게 가공해서 만든 새로운 컬럼입니다.

예제: 판다스에서 컬럼 추가하는 방법

emp 데이터 프레임에 sal 의 데이터와 똑같은 데이터로 sal2 라는 컬럼을 추가하려면 ?

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
emp['sal2'] = emp['sal']            # emp 데이터 프레임에 sal2 컬럼을 추가하는데
                                    # 데이터는 emp 데이터 프레임에 sal 로 하시오
print(emp)

    index  empno   ename        job  ...   sal    comm  deptno  sal2
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10  5000
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30  2850
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10  2450
3       4   7566   JONES    MANAGER  ...  2975     NaN      20  2975
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30  1250
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30  1600
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30  1500
7       8   7900   JAMES      CLERK  ...   950     NaN      30   950
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30  1250
9      10   7902    FORD    ANALYST  ...  3000     NaN      20  3000
10     11   7369   SMITH      CLERK  ...   800     NaN      20   800
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20  3000
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20  1100
13     14   7934  MILLER      CLERK  ...  1300     NaN      10  1300

[14 rows x 10 columns]

문제245. Pandas 를 이용해서 이름과 부서위치를 출력하시오 ! 
	     (emp3.csv 와 dept3.csv 를 이용해서 조인하세요)

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
dept = pd.read_csv('/content/drive/MyDrive/data/dept3.csv')
result = pd.merge(emp, dept, on = 'deptno')
print(result[['ename', 'loc']])

     ename       loc
0     KING  NEW YORK
1    CLARK  NEW YORK
2   MILLER  NEW YORK
3    BLAKE   CHICAGO
4   MARTIN   CHICAGO
5    ALLEN   CHICAGO
6   TURNER   CHICAGO
7    JAMES   CHICAGO
8     WARD   CHICAGO
9    JONES    DALLAS
10    FORD    DALLAS
11   SMITH    DALLAS
12   SCOTT    DALLAS
13   ADAMS    DALLAS

문제246. emp 데이터 프레임에 loc 컬럼을 추가하고 해당 사원의 부서위치로 값을 갱신하시오 !

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
dept = pd.read_csv('/content/drive/MyDrive/data/dept3.csv')
result = pd.merge(emp, dept, on = 'deptno')
emp['loc']  = result['loc']
print(emp)

    index  empno   ename        job  ...   sal    comm  deptno       loc
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10  NEW YORK
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30  NEW YORK
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10  NEW YORK
3       4   7566   JONES    MANAGER  ...  2975     NaN      20   CHICAGO
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30   CHICAGO
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30   CHICAGO
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30   CHICAGO
7       8   7900   JAMES      CLERK  ...   950     NaN      30   CHICAGO
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30   CHICAGO
9      10   7902    FORD    ANALYST  ...  3000     NaN      20    DALLAS
10     11   7369   SMITH      CLERK  ...   800     NaN      20    DALLAS
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20    DALLAS
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20    DALLAS
13     14   7934  MILLER      CLERK  ...  1300     NaN      10    DALLAS

[14 rows x 10 columns]

문제247. 직업, 직업별 평균월급을 Pandas 로 출력하시오!

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('job')['sal'].mean().reset_index()
result['sal'] = result['sal'].astype(int)        # result 데이터 프레임에 sal 을 정수형으로 변환해서
                                                 # result 데이터 프레임 sal 에 반영하겠다. (float 형태로 출력)
print(result)

         job   sal
0    ANALYST  3000
1      CLERK  1037
2    MANAGER  2758
3  PRESIDENT  5000
4   SALESMAN  1400

문제248. emp 와 result 를 서로 조인해서 조인된 전체 데이터 프레임을 출력하시오!

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('job')['sal'].mean().reset_index()   # 여기서 sal 은 평균월급이므로 job 으로 조인
result['sal'] = result['sal'].astype(int)       

result2 = pd.merge(emp, result, how = 'inner', on = 'job')
print(result2)

    index  empno   ename        job  ...  sal_x    comm  deptno  sal_y
0       1   7839    KING  PRESIDENT  ...   5000     NaN      10   5000
1       2   7698   BLAKE    MANAGER  ...   2850     NaN      30   2758
2       3   7782   CLARK    MANAGER  ...   2450     NaN      10   2758
3       4   7566   JONES    MANAGER  ...   2975     NaN      20   2758
4       5   7654  MARTIN   SALESMAN  ...   1250  1400.0      30   1400
5       6   7499   ALLEN   SALESMAN  ...   1600   300.0      30   1400
6       7   7844  TURNER   SALESMAN  ...   1500     0.0      30   1400
7       9   7521    WARD   SALESMAN  ...   1250   500.0      30   1400
8       8   7900   JAMES      CLERK  ...    950     NaN      30   1037
9      11   7369   SMITH      CLERK  ...    800     NaN      20   1037
10     13   7876   ADAMS      CLERK  ...   1100     NaN      20   1037
11     14   7934  MILLER      CLERK  ...   1300     NaN      10   1037
12     10   7902    FORD    ANALYST  ...   3000     NaN      20   3000
13     12   7788   SCOTT    ANALYST  ...   3000     NaN      20   3000

[14 rows x 10 columns]

설명: emp 에도 sal 이 있고 result 에도 sal 이 있어서 emp 의 sal 은 컬럼명이 sal_x 로 변경되었고 result 의 sal 은 sal_y로 변경되었습니다.

문제249. emp 데이터 프레임에 컬럼을 하나 추가하는데 job_avgsal 로 추가하고 문제248번에서 구한 직업별 평균월급인 result2['sal_y'] 의 값으로 값을 갱신하시오!

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('job')['sal'].mean().reset_index()   # 여기서 sal 은 평균월급이므로 job 으로 조인
result['sal'] = result['sal'].astype(int)       

result2 = pd.merge(emp, result, how = 'inner', on = 'job')
emp['job_avgsal'] = result2['sal_y']
print(emp)

    index  empno   ename        job  ...   sal    comm  deptno  job_avgsal
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10        5000
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30        2758
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10        2758
3       4   7566   JONES    MANAGER  ...  2975     NaN      20        2758
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30        1400
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30        1400
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30        1400
7       8   7900   JAMES      CLERK  ...   950     NaN      30        1400
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30        1037
9      10   7902    FORD    ANALYST  ...  3000     NaN      20        1037
10     11   7369   SMITH      CLERK  ...   800     NaN      20        1037
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20        1037
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20        3000
13     14   7934  MILLER      CLERK  ...  1300     NaN      10        3000

[14 rows x 10 columns]

문제250. emp 데이터 프레임에 해당 사원이 근무하는 부서번호의 평균월급을 sal_avg 라는 이름으로 파생변수를 생성하시오 !

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('deptno')['sal'].mean().reset_index()
result['sal'] = result['sal'].astype(int)       

result2 = pd.merge(emp, result, how = 'inner', on = 'deptno')
emp['sal_avg'] = result2['sal_y']
print(emp)

    index  empno   ename        job  ...   sal    comm  deptno  sal_avg
0       1   7839    KING  PRESIDENT  ...  5000     NaN      10     2916
1       2   7698   BLAKE    MANAGER  ...  2850     NaN      30     2916
2       3   7782   CLARK    MANAGER  ...  2450     NaN      10     2916
3       4   7566   JONES    MANAGER  ...  2975     NaN      20     1566
4       5   7654  MARTIN   SALESMAN  ...  1250  1400.0      30     1566
5       6   7499   ALLEN   SALESMAN  ...  1600   300.0      30     1566
6       7   7844  TURNER   SALESMAN  ...  1500     0.0      30     1566
7       8   7900   JAMES      CLERK  ...   950     NaN      30     1566
8       9   7521    WARD   SALESMAN  ...  1250   500.0      30     1566
9      10   7902    FORD    ANALYST  ...  3000     NaN      20     2175
10     11   7369   SMITH      CLERK  ...   800     NaN      20     2175
11     12   7788   SCOTT    ANALYST  ...  3000     NaN      20     2175
12     13   7876   ADAMS      CLERK  ...  1100     NaN      20     2175
13     14   7934  MILLER      CLERK  ...  1300     NaN      10     2175

[14 rows x 10 columns]

문제251. Pandas 로 emp 데이터 프레임을 출력하는데 월급이 높은 사원부터 출력하시오!

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.sort_values('sal', ascending = False)
print(result)

    index  empno   ename        job  ...         hiredate   sal    comm  deptno
0       1   7839    KING  PRESIDENT  ...  1981-11-17 0:00  5000     NaN      10
9      10   7902    FORD    ANALYST  ...  1981-12-11 0:00  3000     NaN      20
11     12   7788   SCOTT    ANALYST  ...  1982-12-22 0:00  3000     NaN      20
3       4   7566   JONES    MANAGER  ...  1981-04-01 0:00  2975     NaN      20
1       2   7698   BLAKE    MANAGER  ...  1981-05-01 0:00  2850     NaN      30
2       3   7782   CLARK    MANAGER  ...  1981-05-09 0:00  2450     NaN      10
5       6   7499   ALLEN   SALESMAN  ...  1981-02-11 0:00  1600   300.0      30
6       7   7844  TURNER   SALESMAN  ...  1981-08-21 0:00  1500     0.0      30
13     14   7934  MILLER      CLERK  ...  1982-01-11 0:00  1300     NaN      10
4       5   7654  MARTIN   SALESMAN  ...  1981-09-10 0:00  1250  1400.0      30
8       9   7521    WARD   SALESMAN  ...  1981-02-23 0:00  1250   500.0      30
12     13   7876   ADAMS      CLERK  ...  1983-01-15 0:00  1100     NaN      20
7       8   7900   JAMES      CLERK  ...  1981-12-11 0:00   950     NaN      30
10     11   7369   SMITH      CLERK  ...  1980-12-09 0:00   800     NaN      20

[14 rows x 9 columns]

설명: Pandas 를 사용할 때 데이터를 정렬하려면 위와 같이 sort_values 함수를 이용하면 됩니다.

    ascending = True   :  오름차순으로 정렬
    ascending = False  :  내림차순으로 정렬

문제252. 아래의 SQL 을 Pandas 로 구현하시오 !

SQL>

    select job, sum(sal)
       from emp
       group by job
       having sum(sal) >= 6000
       order by sum(sal) desc;

Pandas>

In [ ]:
import pandas as pd

emp = pd.read_csv('/content/drive/MyDrive/data/emp3.csv')
result = emp.groupby('job')['sal'].sum().reset_index()
result2 = result[result['sal'] >=6000]
result3 = result2.sort_values('sal', ascending = False)

print(result3)

       job   sal
2  MANAGER  8275
0  ANALYST  6000